DataProcessors/ГИГ_ЗагрузкаДанныхИзВнешнихФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>ГИГ_ЗагрузкаДанныхИзВнешнихФайлов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗагружатьУпаковочныеЛисты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьНоменклатуруПроизводителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПроизводителей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГИГ_НоменклатураПроизводителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетУточнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/ГИГ_НоменклатураПроизводителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ГИГ_НоменклатураПроизводителей</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ГИГ_ЗагрузкаДанныхИзВнешнихФайлов/Forms/ФормаКорректировкиНоменклатурыПроизводителей/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьМассивИтоговыхДанных()
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(УточнениеНоменклатуры.Выгрузить())
	
КонецФункции

&НаКлиенте
Процедура Перенести(Команда)
	
	ТЧУТочнение = ПолучитьМассивИтоговыхДанных();
	
	Закрыть(ТЧУТочнение);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		
	
	Если Параметры.Свойство("ТаблицаУточнения") Тогда
		
		Для Каждого Стр Из Параметры.ТаблицаУточнения Цикл
			
			НоваяСтрока = УточнениеНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры






&НаСервере
Процедура ОбновитьДанныеПоНоменлатуреНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ГИГ_НоменклатураПроизводителей.Ссылка КАК НоменклатураПроизводителей,
	|	ГИГ_НоменклатураПроизводителей.Номенклатура КАК Номенклатура,
	|	ГИГ_НоменклатураПроизводителей.Номенклатура.Артикул КАК Артикул,
	|	ГИГ_НоменклатураПроизводителей.Артикул КАК АртикулПроизводителя,
	|	ГИГ_НоменклатураПроизводителей.Производитель КАК Производитель
	|ИЗ
	|	Справочник.ГИГ_НоменклатураПроизводителей КАК ГИГ_НоменклатураПроизводителей
	|ГДЕ
	|	ГИГ_НоменклатураПроизводителей.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", УточнениеНоменклатуры.Выгрузить().ВыгрузитьКолонку("НоменклатураПроизводителей"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НоменклатураПроизводителей", Выборка.НоменклатураПроизводителей);
		НайденныеСтроки = УточнениеНоменклатуры.НайтиСтроки(ПараметрыОтбора); 

		Для Каждого Стр Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(Стр, Выборка, "Номенклатура, АртикулПроизводителя, Артикул, Производитель");
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоНоменлатуре(Команда)
	
	ОбновитьДанныеПоНоменлатуреНаСервере();
	
КонецПроцедуры

&НаСервере
Функция СоздатьНоменклатуруПоНоменклатуреПроизводителяНаСервере(НоменклатураПроизводителя)
	
	Результат = НоменклатураПроизводителя.Номенклатура;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда		
		
		ВидНоменклатурыДляСоздания = НоменклатураПроизводителя.ВидНоменклатуры;
		
		Если ЗначениеЗаполнено(ВидНоменклатурыДляСоздания) Тогда
			
			Результат = ГИГ_МодульВызовСервера.СозданиеНоменклатурыНаСервере(НоменклатураПроизводителя, ВидНоменклатурыДляСоздания);
			
		Иначе
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "У номенклатуры производителя """ + Строка(НоменклатураПроизводителя) + """ не заполнен реквизит ""Вид номенклатуры""";
			СообщениеПользователю.Сообщить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьАртикулНоменклатуры(Номенклатура)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Результат = Номенклатура.Артикул;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СоздатьНоменклатуруПоНоменклатуреПроизводителя(Команда)
	
	Для Каждого Стр Из Элементы.УточнениеНоменклатуры.ВыделенныеСтроки Цикл
		
		ТекущаяСтрока = УточнениеНоменклатуры.НайтиПоИдентификатору(Стр);
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.НоменклатураПроизводителей) Тогда
			
			ТекущаяСтрока.Номенклатура = СоздатьНоменклатуруПоНоменклатуреПроизводителяНаСервере(ТекущаяСтрока.НоменклатураПроизводителей);
			ТекущаяСтрока.Артикул = ПолучитьАртикулНоменклатуры(ТекущаяСтрока.Номенклатура);
						
		Иначе
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "В указанной строке не заполнена номенклатура производителя";
			СообщениеПользователю.Сообщить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//++Гольм А.А. (Гигабайт)
&НаКлиенте
Процедура ВыделитьВсё(Команда)
	
	Для Каждого ТекСтр Из Элементы.УточнениеНоменклатуры.ВыделенныеСтроки Цикл
		
		ТекущаяСтрока = УточнениеНоменклатуры.Получить(ТекСтр);
		ТекущаяСтрока.ВыбратьСтроку = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсё(Команда)
	
	Для Каждого ТекСтр Из Элементы.УточнениеНоменклатуры.ВыделенныеСтроки Цикл
		
		ТекущаяСтрока = УточнениеНоменклатуры.Получить(ТекСтр);
		ТекущаяСтрока.ВыбратьСтроку = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры
//--Гольм А.А. (Гигабайт)
